### 쇼핑몰의 고객 정보를 기반으로 기계학습을 위한 EDA(전처리)

In [105]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

In [106]:
# 시각화 library -seaborn의 기초, 섬세한 표현 작업싱에는 matplotlib도 필요로 함
import matplotlib.pyplot as plt

# 한글 인코딩 처리
plt.rc('font', family='malgun gothic')

# - 기호 깨짐 현상 방지를 위한 설정
plt.rc('axes', unicode_minus=False)

# jupyter notebook에서 chart를 그리기 위한 설정
%matplotlib inline

#### 데이터 로딩

**mem_data.csv 고객정보데이터**

- 'MEM_ID' : 회원코드
- 'M_STORE_ID' : 가맹점 코드
- 'GENDER' :남(M), 여(F) 
- 'BIRTH_DT' :생년월일
- 'BIRTH_SL' : 양력(S), 음력(L)
- 'ZIP_CD' : 우편번호
- 'RGST_DT' : 등록일
- 'VISIT_CNT' : 방문횟수
- 'SALES_AMT' : 구매 합계
- 'LAST_VST_DT' : 최근 방문 일자
- 'USABLE_PNT' : 가용 포인트
- 'USED_PNT' : 사용포인트 합계
- 'ACC_PNT' : 누적포인트 합계
- 'USABLE_INIT' : 초기 포인트
- 'SMS' : SNS 수신동의

<hr>

**mem_transaction.csv**

- 'STORE_ID' : 판매매장 코드
- 'SELL_DT' : 판매일자
- 'MEMP_STY' : 주문 시 생성(O), 추후 적립(M), 웹입력(W)
- 'MEM_ID' : 회원코드
- 'MEMP_DT' : 판매 금액
- 'SELL_AMT' : 판매금액
- 'MEMP_TP' : A-적립, U:사용, R:조회

<hr>

**store_info.csv**
- STORE_CD : 판매점코드
- STORE_REGION : 판매점 지역

In [107]:
mem_data.head()

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,...,USABLE_INIT,SMS,AGE,R_MONTH,E_DAY,R_REGION,STORE_ID_x,STORE_REGION_x,STORE_ID_y,STORE_REGION_y
0,1134945,1084,M,NaT,S,NaN,2006-02-04 11:51:08.233,8.0,337000.0,2007-01-19 21:46:12.827,...,3202.0,Y,NaN,2,292,NaN,NaN,NaN,NaN,NaN
1,38458,539,F,1973-07-11,S,420-721,2006-02-04 11:51:08.233,22.0,1438500.0,2007-10-18 19:57:45.503,...,17762.0,Y,48.473648,2,20,4,NaN,NaN,NaN,NaN
2,7009,1113,F,1973-04-06,S,NaN,2006-02-04 11:51:08.233,8.0,309300.0,2007-05-30 15:21:10.863,...,1856.0,Y,48.736482,2,161,NaN,NaN,NaN,NaN,NaN
3,1374842,1300,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,110300.0,2007-03-25 12:49:30.170,...,1522.0,Y,NaN,2,227,NaN,NaN,NaN,NaN,NaN
4,1383660,1024,M,NaT,S,NaN,2006-02-05 16:56:58.000,2.0,33500.0,2006-09-09 14:55:21.687,...,110.0,Y,NaN,2,424,NaN,NaN,NaN,NaN,NaN

In [108]:
mem_data = pd.read_csv('0.dataSet/mem_data.csv')
mem_tr = pd.read_csv('0.dataSet/mem_transaction.csv')
store_info = pd.read_csv('0.dataSet/store_info.csv')

In [109]:
mem_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7534 entries, 0 to 7533
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MEM_ID       7534 non-null   int64
 1   M_STORE_ID   7534 non-null   int64
 2   GENDER       7534 non-null   object
 3   BIRTH_DT     4193 non-null   object
 4   BIRTH_SL     7534 non-null   object
 5   ZIP_CD       7534 non-null   object
 6   RGST_DT      7534 non-null   object
 7   VISIT_CNT    7534 non-null   float64
 8   SALES_AMT    7534 non-null   float64
 9   LAST_VST_DT  7534 non-null   object
 10  USABLE_PNT   7534 non-null   float64
 11  USED_PNT     7534 non-null   float64
 12  ACC_PNT      7534 non-null   float64
 13  USABLE_INIT  7534 non-null   float64
 14  SMS          7534 non-null   object
dtypes: float64(6), int64(2), object(7)
memory usage: 883.0+ KB

In [110]:
mem_data.columns

Index(['MEM_ID', 'M_STORE_ID', 'GENDER', 'BIRTH_DT', 'BIRTH_SL', 'ZIP_CD',
       'RGST_DT', 'VISIT_CNT', 'SALES_AMT', 'LAST_VST_DT', 'USABLE_PNT',
       'USED_PNT', 'ACC_PNT', 'USABLE_INIT', 'SMS'],
      dtype='object')

In [111]:
mem_tr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60049 entries, 0 to 60048
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   STORE_ID  60049 non-null  int64
 1   SELL_DT   60049 non-null  int64
 2   MEMP_STY  60049 non-null  object
 3   MEM_ID    60049 non-null  int64
 4   MEMP_DT   60049 non-null  object
 5   SELL_AMT  60049 non-null  int64
 6   MEMP_TP   60049 non-null  object
dtypes: int64(4), object(3)
memory usage: 3.2+ MB

In [112]:
mem_tr.columns

Index(['STORE_ID', 'SELL_DT', 'MEMP_STY', 'MEM_ID', 'MEMP_DT', 'SELL_AMT',
       'MEMP_TP'],
      dtype='object')

In [113]:
store_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 329 entries, 0 to 328
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   STORE_ID      329 non-null    int64
 1   STORE_REGION  329 non-null    int64
dtypes: int64(2)
memory usage: 5.3 KB

In [114]:
store_info.columns

Index(['STORE_ID', 'STORE_REGION'], dtype='object')

In [115]:
# 각 컬럼별 데이터 개수 카운트
# 데이터에 - 표기가 많은, 전처리 해결책 : 강제적으로 결측치로 대체
mem_data.ZIP_CD.value_counts()

-          6585
158-826      14
480-070      11
467-866      11
467-863       8
           ...
404-231       1
702-785       1
630-800       1
467-740       1
138-229       1
Name: ZIP_CD, Length: 624, dtype: int64

In [116]:
mem_data.ZIP_CD =='-'

0        True
1       False
2        True
3        True
4        True
        ...
7529     True
7530     True
7531     True
7532     True
7533    False
Name: ZIP_CD, Length: 7534, dtype: bool

In [117]:
mem_data.loc[mem_data.ZIP_CD =='-']

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,USABLE_PNT,USED_PNT,ACC_PNT,USABLE_INIT,SMS
0,1134945,1084,M,NaN,S,-,2006-02-04 11:51:08.233000000,8.0,337000.0,2007-01-19 21:46:12.827000000,6740.0,0.0,6740.0,3202.0,Y
2,7009,1113,F,1973-04-06,S,-,2006-02-04 11:51:08.233000000,8.0,309300.0,2007-05-30 15:21:10.863000000,6372.0,0.0,6372.0,1856.0,Y
3,1374842,1300,M,NaN,S,-,2006-02-04 11:51:08.233000000,3.0,110300.0,2007-03-25 12:49:30.170000000,2206.0,0.0,2206.0,1522.0,Y
4,1383660,1024,M,NaN,S,-,2006-02-05 16:56:58,2.0,33500.0,2006-09-09 14:55:21.687000000,670.0,0.0,670.0,110.0,Y
5,911717,10792,M,NaN,S,-,2006-02-04 11:51:08.233000000,18.0,227400.0,2007-10-21 17:16:03.257000000,4548.0,0.0,4548.0,842.0,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7528,268317,997,F,1980-02-03,S,-,2006-02-04 11:51:08.233000000,8.0,176200.0,2007-08-09 20:33:59.167000000,1264.0,3000.0,4264.0,1978.0,Y
7529,343892,130,F,1983-04-28,S,-,2006-02-04 11:51:08.233000000,22.0,383300.0,2007-10-28 12:35:20.587000000,7866.0,0.0,7866.0,2884.0,Y
7530,312177,130,F,1981-08-24,S,-,2006-02-04 11:51:08.233000000,18.0,385800.0,2007-11-07 19:22:06.137000000,870.0,7000.0,7870.0,4292.0,Y
7531,454881,1181,M,NaN,S,-,2006-02-04 11:51:08.233000000,3.0,85800.0,2007-04-14 21:13:18.977000000,1716.0,0.0,1716.0,0.0,Y
7532,973807,812,M,NaN,S,-,2006-02-04 11:51:08.233000000,4.0,208200.0,2007-09-12 12:58:43.683000000,4164.0,0.0,4164.0,1110.0,Y

In [118]:
# 데이터 분석을 함에 있어서 우편번호는 - 만으로는 적용 불가 따라서 반드시 대체 (단, 고객정보 무를 의미하는 nan값으로 대체)
mem_data.loc[mem_data.ZIP_CD =='-', 'ZIP_CD'] = np.nan

In [119]:
mem_data.ZIP_CD.value_counts()

158-826    14
480-070    11
467-866    11
467-070     8
482-852     8
           ..
486-823     1
122-908     1
130-102     1
122-090     1
138-229     1
Name: ZIP_CD, Length: 623, dtype: int64

### **날짜형 변수 처리**

In [120]:
col = ['BIRTH_DT', 'RGST_DT', 'LAST_VST_DT']
mem_data[col]

        BIRTH_DT                        RGST_DT                    LAST_VST_DT
0            NaN  2006-02-04 11:51:08.233000000  2007-01-19 21:46:12.827000000
1     1973-07-11  2006-02-04 11:51:08.233000000  2007-10-18 19:57:45.503000000
2     1973-04-06  2006-02-04 11:51:08.233000000  2007-05-30 15:21:10.863000000
3            NaN  2006-02-04 11:51:08.233000000  2007-03-25 12:49:30.170000000
4            NaN            2006-02-05 16:56:58  2006-09-09 14:55:21.687000000
...          ...                            ...                            ...
7529  1983-04-28  2006-02-04 11:51:08.233000000  2007-10-28 12:35:20.587000000
7530  1981-08-24  2006-02-04 11:51:08.233000000  2007-11-07 19:22:06.137000000
7531         NaN  2006-02-04 11:51:08.233000000  2007-04-14 21:13:18.977000000
7532         NaN  2006-02-04 11:51:08.233000000  2007-09-12 12:58:43.683000000
7533  1979-12-31  2006-02-04 11:51:08.233000000  2007-02-26 20:59:18.540000000

[7534 rows x 3 columns]

In [121]:
col

['BIRTH_DT', 'RGST_DT', 'LAST_VST_DT']

In [122]:
# 각 시리즈(컬럼)별 row수 만큼 함수 호출 : apply()
# to_datetime()변환시 Nan값으로 에러 발생 
# 결측치는 그냥 결측치로 하면서 유효 데이터만 날짜 포멧으로 변경 가능한 옵션 : errors='coerce'
# NaN -> NaT 변경
mem_data[col] = mem_data[col].apply(pd.to_datetime, errors='coerce')

In [123]:
mem_data[col]

       BIRTH_DT                 RGST_DT             LAST_VST_DT
0           NaT 2006-02-04 11:51:08.233 2007-01-19 21:46:12.827
1    1973-07-11 2006-02-04 11:51:08.233 2007-10-18 19:57:45.503
2    1973-04-06 2006-02-04 11:51:08.233 2007-05-30 15:21:10.863
3           NaT 2006-02-04 11:51:08.233 2007-03-25 12:49:30.170
4           NaT 2006-02-05 16:56:58.000 2006-09-09 14:55:21.687
...         ...                     ...                     ...
7529 1983-04-28 2006-02-04 11:51:08.233 2007-10-28 12:35:20.587
7530 1981-08-24 2006-02-04 11:51:08.233 2007-11-07 19:22:06.137
7531        NaT 2006-02-04 11:51:08.233 2007-04-14 21:13:18.977
7532        NaT 2006-02-04 11:51:08.233 2007-09-12 12:58:43.683
7533 1979-12-31 2006-02-04 11:51:08.233 2007-02-26 20:59:18.540

[7534 rows x 3 columns]

### **나이컬럼 추가**

In [124]:
mem_data.BIRTH_DT

0             NaT
1      1973-07-11
2      1973-04-06
3             NaT
4             NaT
          ...
7529   1983-04-28
7530   1981-08-24
7531          NaT
7532          NaT
7533   1979-12-31
Name: BIRTH_DT, Length: 7534, dtype: datetime64[ns]

In [125]:
mem_data.BIRTH_DT.describe()

<ipython-input-125-b56d7f0e0546>:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  mem_data.BIRTH_DT.describe()

count                    4180
unique                   3248
top       2003-11-03 00:00:00
freq                       90
first     1937-08-12 00:00:00
last      2067-10-24 00:00:00
Name: BIRTH_DT, dtype: object

In [126]:
(pd.to_datetime('2012-12-31') - mem_data.BIRTH_DT).dt.days

0           NaN
1       14418.0
2       14514.0
3           NaN
4           NaN
         ...
7529    10840.0
7530    11452.0
7531        NaN
7532        NaN
7533    12054.0
Name: BIRTH_DT, Length: 7534, dtype: float64

In [127]:
(pd.to_datetime('2021-12-31') - mem_data.BIRTH_DT).dt.days

0           NaN
1       17705.0
2       17801.0
3           NaN
4           NaN
         ...
7529    14127.0
7530    14739.0
7531        NaN
7532        NaN
7533    15341.0
Name: BIRTH_DT, Length: 7534, dtype: float64

In [128]:
# 윤달포함된 연산 결과를 도출하기 위해 날짜에서 /365가 아닌 365.25 수치값으로 나누라 함 
((pd.to_datetime('2021-12-31') - mem_data.BIRTH_DT).dt.days) / 365.25

0             NaN
1       48.473648
2       48.736482
3             NaN
4             NaN
          ...
7529    38.677618
7530    40.353183
7531          NaN
7532          NaN
7533    42.001369
Name: BIRTH_DT, Length: 7534, dtype: float64

In [129]:
# float타입 변환은 nan값 허용, int로 변환시도시에 nan값으로 에러 발생
# 정수로 변경 전 nan값을  수치 0 으로 변경 후 int로 변환
mem_data['AGE'] = (((pd.to_datetime('2021-12-31') - mem_data.BIRTH_DT).dt.days) / 365.25)

In [130]:
mem_data.head()

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,USABLE_PNT,USED_PNT,ACC_PNT,USABLE_INIT,SMS,AGE
0,1134945,1084,M,NaT,S,NaN,2006-02-04 11:51:08.233,8.0,337000.0,2007-01-19 21:46:12.827,6740.0,0.0,6740.0,3202.0,Y,NaN
1,38458,539,F,1973-07-11,S,420-721,2006-02-04 11:51:08.233,22.0,1438500.0,2007-10-18 19:57:45.503,1732.0,12000.0,13732.0,17762.0,Y,48.473648
2,7009,1113,F,1973-04-06,S,NaN,2006-02-04 11:51:08.233,8.0,309300.0,2007-05-30 15:21:10.863,6372.0,0.0,6372.0,1856.0,Y,48.736482
3,1374842,1300,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,110300.0,2007-03-25 12:49:30.170,2206.0,0.0,2206.0,1522.0,Y,NaN
4,1383660,1024,M,NaT,S,NaN,2006-02-05 16:56:58.000,2.0,33500.0,2006-09-09 14:55:21.687,670.0,0.0,670.0,110.0,Y,NaN

In [131]:
mem_data.BIRTH_DT

0             NaT
1      1973-07-11
2      1973-04-06
3             NaT
4             NaT
          ...
7529   1983-04-28
7530   1981-08-24
7531          NaT
7532          NaT
7533   1979-12-31
Name: BIRTH_DT, Length: 7534, dtype: datetime64[ns]

In [132]:
mem_data.BIRTH_DT.dt.month

0        NaN
1        7.0
2        4.0
3        NaN
4        NaN
        ...
7529     4.0
7530     8.0
7531     NaN
7532     NaN
7533    12.0
Name: BIRTH_DT, Length: 7534, dtype: float64

In [133]:
mem_data.BIRTH_DT.dt.year

0          NaN
1       1973.0
2       1973.0
3          NaN
4          NaN
         ...
7529    1983.0
7530    1981.0
7531       NaN
7532       NaN
7533    1979.0
Name: BIRTH_DT, Length: 7534, dtype: float64

**등록월 추출해서 R_MONTH라는 컬럼 추가**

In [134]:
# 등록일 컬럼 - RGST_DT

In [135]:
mem_data.RGST_DT.dt.month

0       2
1       2
2       2
3       2
4       2
       ..
7529    2
7530    2
7531    2
7532    2
7533    2
Name: RGST_DT, Length: 7534, dtype: int64

In [136]:
mem_data['R_MONTH'] = mem_data.RGST_DT.dt.month

In [137]:
mem_data

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,USABLE_PNT,USED_PNT,ACC_PNT,USABLE_INIT,SMS,AGE,R_MONTH
0,1134945,1084,M,NaT,S,NaN,2006-02-04 11:51:08.233,8.0,337000.0,2007-01-19 21:46:12.827,6740.0,0.0,6740.0,3202.0,Y,NaN,2
1,38458,539,F,1973-07-11,S,420-721,2006-02-04 11:51:08.233,22.0,1438500.0,2007-10-18 19:57:45.503,1732.0,12000.0,13732.0,17762.0,Y,48.473648,2
2,7009,1113,F,1973-04-06,S,NaN,2006-02-04 11:51:08.233,8.0,309300.0,2007-05-30 15:21:10.863,6372.0,0.0,6372.0,1856.0,Y,48.736482,2
3,1374842,1300,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,110300.0,2007-03-25 12:49:30.170,2206.0,0.0,2206.0,1522.0,Y,NaN,2
4,1383660,1024,M,NaT,S,NaN,2006-02-05 16:56:58.000,2.0,33500.0,2006-09-09 14:55:21.687,670.0,0.0,670.0,110.0,Y,NaN,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7529,343892,130,F,1983-04-28,S,NaN,2006-02-04 11:51:08.233,22.0,383300.0,2007-10-28 12:35:20.587,7866.0,0.0,7866.0,2884.0,Y,38.677618,2
7530,312177,130,F,1981-08-24,S,NaN,2006-02-04 11:51:08.233,18.0,385800.0,2007-11-07 19:22:06.137,870.0,7000.0,7870.0,4292.0,Y,40.353183,2
7531,454881,1181,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,85800.0,2007-04-14 21:13:18.977,1716.0,0.0,1716.0,0.0,Y,NaN,2
7532,973807,812,M,NaT,S,NaN,2006-02-04 11:51:08.233,4.0,208200.0,2007-09-12 12:58:43.683,4164.0,0.0,4164.0,1110.0,Y,NaN,2
7533,47542,2273,F,1979-12-31,S,142-872,2006-02-04 11:51:08.233,3.0,208200.0,2007-02-26 20:59:18.540,4164.0,0.0,4164.0,3368.0,Y,42.001369,2

### **최근 방문 일자(LAST_VST_DT)로 부터 경과일 구하기**

In [138]:
mem_data.LAST_VST_DT

0      2007-01-19 21:46:12.827
1      2007-10-18 19:57:45.503
2      2007-05-30 15:21:10.863
3      2007-03-25 12:49:30.170
4      2006-09-09 14:55:21.687
                 ...
7529   2007-10-28 12:35:20.587
7530   2007-11-07 19:22:06.137
7531   2007-04-14 21:13:18.977
7532   2007-09-12 12:58:43.683
7533   2007-02-26 20:59:18.540
Name: LAST_VST_DT, Length: 7534, dtype: datetime64[ns]

In [139]:
mem_data.LAST_VST_DT.value_counts()

2006-12-29 16:56:54.643    1
2006-08-21 17:49:25.077    1
2007-10-14 13:26:10.663    1
2007-10-06 16:40:24.650    1
2006-06-13 19:37:43.013    1
                          ..
2006-03-06 18:43:31.787    1
2007-01-04 17:09:36.947    1
2006-03-10 20:27:51.627    1
2007-10-26 14:06:41.750    1
2007-06-23 14:55:19.380    1
Name: LAST_VST_DT, Length: 7534, dtype: int64

In [140]:
mem_data.LAST_VST_DT.max()

Timestamp('2007-11-08 21:22:11.797000')

In [141]:
(pd.to_datetime('2007-11-08') - mem_data.LAST_VST_DT)

0      292 days 02:13:47.173000
1       20 days 04:02:14.497000
2      161 days 08:38:49.137000
3      227 days 11:10:29.830000
4      424 days 09:04:38.313000
                 ...
7529    10 days 11:24:39.413000
7530     0 days 04:37:53.863000
7531   207 days 02:46:41.023000
7532    56 days 11:01:16.317000
7533   254 days 03:00:41.460000
Name: LAST_VST_DT, Length: 7534, dtype: timedelta64[ns]

In [142]:
(pd.to_datetime('2007-11-08') - mem_data.LAST_VST_DT).dt.days

0       292
1        20
2       161
3       227
4       424
       ...
7529     10
7530      0
7531    207
7532     56
7533    254
Name: LAST_VST_DT, Length: 7534, dtype: int64

In [143]:
mem_data['E_DAY'] = (pd.to_datetime('2007-11-08') - mem_data.LAST_VST_DT).dt.days
mem_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7534 entries, 0 to 7533
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MEM_ID       7534 non-null   int64
 1   M_STORE_ID   7534 non-null   int64
 2   GENDER       7534 non-null   object
 3   BIRTH_DT     4180 non-null   datetime64[ns]
 4   BIRTH_SL     7534 non-null   object
 5   ZIP_CD       949 non-null    object
 6   RGST_DT      7534 non-null   datetime64[ns]
 7   VISIT_CNT    7534 non-null   float64
 8   SALES_AMT    7534 non-null   float64
 9   LAST_VST_DT  7534 non-null   datetime64[ns]
 10  USABLE_PNT   7534 non-null   float64
 11  USED_PNT     7534 non-null   float64
 12  ACC_PNT      7534 non-null   float64
 13  USABLE_INIT  7534 non-null   float64
 14  SMS          7534 non-null   object
 15  AGE          4180 non-null   float64
 16  R_MONTH      7534 non-null   int64
 17  E_DAY        7534 non-null   int64
dtypes: datetime64[ns](3), float64(7), int64(4), object(4)
memory usage: 1.0+ MB

In [144]:
mem_data.ZIP_CD

0           NaN
1       420-721
2           NaN
3           NaN
4           NaN
         ...
7529        NaN
7530        NaN
7531        NaN
7532        NaN
7533    142-872
Name: ZIP_CD, Length: 7534, dtype: object

In [145]:
type(mem_data.ZIP_CD.str)

pandas.core.strings.StringMethods

In [146]:
mem_data.ZIP_CD.str.get(0)

0       NaN
1         4
2       NaN
3       NaN
4       NaN
       ...
7529    NaN
7530    NaN
7531    NaN
7532    NaN
7533      1
Name: ZIP_CD, Length: 7534, dtype: object

In [147]:
mem_data['R_REGION'] = mem_data.ZIP_CD.str.get(0)
mem_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7534 entries, 0 to 7533
Data columns (total 19 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MEM_ID       7534 non-null   int64
 1   M_STORE_ID   7534 non-null   int64
 2   GENDER       7534 non-null   object
 3   BIRTH_DT     4180 non-null   datetime64[ns]
 4   BIRTH_SL     7534 non-null   object
 5   ZIP_CD       949 non-null    object
 6   RGST_DT      7534 non-null   datetime64[ns]
 7   VISIT_CNT    7534 non-null   float64
 8   SALES_AMT    7534 non-null   float64
 9   LAST_VST_DT  7534 non-null   datetime64[ns]
 10  USABLE_PNT   7534 non-null   float64
 11  USED_PNT     7534 non-null   float64
 12  ACC_PNT      7534 non-null   float64
 13  USABLE_INIT  7534 non-null   float64
 14  SMS          7534 non-null   object
 15  AGE          4180 non-null   float64
 16  R_MONTH      7534 non-null   int64
 17  E_DAY        7534 non-null   int64
 18  R_REGION     949 non-null    object
dtypes: datetime64[ns](3), float64(7), int64(4), object(5)
memory usage: 1.1+ MB

### **다른 데이터와 연동하여 파생변수 생성해 보기**

In [148]:
mem_data.columns

Index(['MEM_ID', 'M_STORE_ID', 'GENDER', 'BIRTH_DT', 'BIRTH_SL', 'ZIP_CD',
       'RGST_DT', 'VISIT_CNT', 'SALES_AMT', 'LAST_VST_DT', 'USABLE_PNT',
       'USED_PNT', 'ACC_PNT', 'USABLE_INIT', 'SMS', 'AGE', 'R_MONTH', 'E_DAY',
       'R_REGION'],
      dtype='object')

In [149]:
store_info.columns

Index(['STORE_ID', 'STORE_REGION'], dtype='object')

In [150]:
mem_data.merge(store_info, left_on='M_STORE_ID', right_on='STORE_ID',how='left').shape

(7534, 21)

In [151]:
mem_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7534 entries, 0 to 7533
Data columns (total 19 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MEM_ID       7534 non-null   int64
 1   M_STORE_ID   7534 non-null   int64
 2   GENDER       7534 non-null   object
 3   BIRTH_DT     4180 non-null   datetime64[ns]
 4   BIRTH_SL     7534 non-null   object
 5   ZIP_CD       949 non-null    object
 6   RGST_DT      7534 non-null   datetime64[ns]
 7   VISIT_CNT    7534 non-null   float64
 8   SALES_AMT    7534 non-null   float64
 9   LAST_VST_DT  7534 non-null   datetime64[ns]
 10  USABLE_PNT   7534 non-null   float64
 11  USED_PNT     7534 non-null   float64
 12  ACC_PNT      7534 non-null   float64
 13  USABLE_INIT  7534 non-null   float64
 14  SMS          7534 non-null   object
 15  AGE          4180 non-null   float64
 16  R_MONTH      7534 non-null   int64
 17  E_DAY        7534 non-null   int64
 18  R_REGION     949 non-null    object
dtypes: datetime64[ns](3), float64(7), int64(4), object(5)
memory usage: 1.1+ MB

In [152]:
(mem_data.M_STORE_ID==997).sum()

1643

In [153]:
mem_data = mem_data.merge(store_info, left_on='M_STORE_ID', right_on='STORE_ID',how='left')
mem_data

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,...,USED_PNT,ACC_PNT,USABLE_INIT,SMS,AGE,R_MONTH,E_DAY,R_REGION,STORE_ID,STORE_REGION
0,1134945,1084,M,NaT,S,NaN,2006-02-04 11:51:08.233,8.0,337000.0,2007-01-19 21:46:12.827,...,0.0,6740.0,3202.0,Y,NaN,2,292,NaN,NaN,NaN
1,38458,539,F,1973-07-11,S,420-721,2006-02-04 11:51:08.233,22.0,1438500.0,2007-10-18 19:57:45.503,...,12000.0,13732.0,17762.0,Y,48.473648,2,20,4,NaN,NaN
2,7009,1113,F,1973-04-06,S,NaN,2006-02-04 11:51:08.233,8.0,309300.0,2007-05-30 15:21:10.863,...,0.0,6372.0,1856.0,Y,48.736482,2,161,NaN,NaN,NaN
3,1374842,1300,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,110300.0,2007-03-25 12:49:30.170,...,0.0,2206.0,1522.0,Y,NaN,2,227,NaN,NaN,NaN
4,1383660,1024,M,NaT,S,NaN,2006-02-05 16:56:58.000,2.0,33500.0,2006-09-09 14:55:21.687,...,0.0,670.0,110.0,Y,NaN,2,424,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7529,343892,130,F,1983-04-28,S,NaN,2006-02-04 11:51:08.233,22.0,383300.0,2007-10-28 12:35:20.587,...,0.0,7866.0,2884.0,Y,38.677618,2,10,NaN,130.0,11.0
7530,312177,130,F,1981-08-24,S,NaN,2006-02-04 11:51:08.233,18.0,385800.0,2007-11-07 19:22:06.137,...,7000.0,7870.0,4292.0,Y,40.353183,2,0,NaN,130.0,11.0
7531,454881,1181,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,85800.0,2007-04-14 21:13:18.977,...,0.0,1716.0,0.0,Y,NaN,2,207,NaN,NaN,NaN
7532,973807,812,M,NaT,S,NaN,2006-02-04 11:51:08.233,4.0,208200.0,2007-09-12 12:58:43.683,...,0.0,4164.0,1110.0,Y,NaN,2,56,NaN,NaN,NaN
7533,47542,2273,F,1979-12-31,S,142-872,2006-02-04 11:51:08.233,3.0,208200.0,2007-02-26 20:59:18.540,...,0.0,4164.0,3368.0,Y,42.001369,2,254,1,NaN,NaN

In [157]:
# 의미없는 가맹점 STORE_ID 삭제(drop)
mem_data = mem_data.drop('STORE_ID', axis='columns')
mem_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7534 entries, 0 to 7533
Data columns (total 20 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   MEM_ID        7534 non-null   int64
 1   M_STORE_ID    7534 non-null   int64
 2   GENDER        7534 non-null   object
 3   BIRTH_DT      4180 non-null   datetime64[ns]
 4   BIRTH_SL      7534 non-null   object
 5   ZIP_CD        949 non-null    object
 6   RGST_DT       7534 non-null   datetime64[ns]
 7   VISIT_CNT     7534 non-null   float64
 8   SALES_AMT     7534 non-null   float64
 9   LAST_VST_DT   7534 non-null   datetime64[ns]
 10  USABLE_PNT    7534 non-null   float64
 11  USED_PNT      7534 non-null   float64
 12  ACC_PNT       7534 non-null   float64
 13  USABLE_INIT   7534 non-null   float64
 14  SMS           7534 non-null   object
 15  AGE           4180 non-null   float64
 16  R_MONTH       7534 non-null   int64
 17  E_DAY         7534 non-null   int64
 18  R_REGION      949 non-null    object
 19  STORE_REGION  799 non-null    float64
dtypes: datetime64[ns](3), float64(8), int64(4), object(5)
memory usage: 1.2+ MB

## **평균 구매액을 고객정보 DataFrame에 추가:TOTAL_AMT**

In [158]:
mem_tr.shape

(60049, 7)

In [159]:
mem_tr.columns

Index(['STORE_ID', 'SELL_DT', 'MEMP_STY', 'MEM_ID', 'MEMP_DT', 'SELL_AMT',
       'MEMP_TP'],
      dtype='object')

In [160]:
mem_tr.value_counts()

STORE_ID  SELL_DT   MEMP_STY  MEM_ID   MEMP_DT                        SELL_AMT  MEMP_TP
1022001   20071028  O         829771   2007-10-28 17:58:24.093000000  38500     A          1
997       20061108  O         1129661  2006-11-08 18:17:40.777000000  25700     A          1
          20061109  O         455532   2006-11-09 12:05:52.407000000  28900     A          1
                              411466   2006-11-09 19:34:57.217000000  20900     A          1
                              398577   2006-11-09 19:56:40.833000000  5900      A          1
                                                                                          ..
1873      20060410  O         991020   2006-04-10 10:34:23.033000000  34800     A          1
          20060407  O         1089365  2006-04-07 18:29:38.270000000  44400     A          1
                              991297   2006-04-07 18:05:42.287000000  28700     A          1
          20060402  O         1110470  2006-04-02 15:31:21.027000000  11800     A          1
125       20060227  O         1225434  2006-02-27 13:57:44.750000000  15500     A          1
Length: 60049, dtype: int64

In [161]:
mem_tr.groupby('MEM_ID')['SELL_AMT']

In [162]:
# 새로나온 편리한 문법 - 생성하고자하는 시리즈(컬럼) 명시와 로직을 agg parameter로 적용
mem_tr.groupby('MEM_ID')['SELL_AMT'].agg(TOTAL_AMT='mean')

                  TOTAL_AMT
MEM_ID
957             2500.000000
1054           38120.000000
1067            7700.000000
1068            8255.555556
1078            5900.000000
...                     ...
2007042901468   3300.000000
2007061900497   7700.000000
2007062900420   5700.000000
2007090300653  32033.333333
2007090300704  23500.000000

[10764 rows x 1 columns]

In [185]:
# 레벨이 분리되어 있던 컬럼명을 동일한 레벨로 맞춤, reset_index 적용
v = mem_tr.groupby('MEM_ID')['SELL_AMT'].agg(TOTAL_AMT='mean').reset_index()
v.groupby('MEM_ID').head(1)

              MEM_ID     TOTAL_AMT
0                957   2500.000000
1               1054  38120.000000
2               1067   7700.000000
3               1068   8255.555556
4               1078   5900.000000
...              ...           ...
10759  2007042901468   3300.000000
10760  2007061900497   7700.000000
10761  2007062900420   5700.000000
10762  2007090300653  32033.333333
10763  2007090300704  23500.000000

[10764 rows x 2 columns]

In [190]:
# MEM_ID는 동일하게 두개의 DataFrame 내에 존재 따라서 left_on과 right_on은 생략 가능
# 동일한 ID의 데이터에 병합
mem_data = mem_data.merge(v, how='left')
mem_data

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,...,USED_PNT,ACC_PNT,USABLE_INIT,SMS,AGE,R_MONTH,E_DAY,R_REGION,STORE_REGION,TOTAL_AMT
0,1134945,1084,M,NaT,S,NaN,2006-02-04 11:51:08.233,8.0,337000.0,2007-01-19 21:46:12.827,...,0.0,6740.0,3202.0,Y,NaN,2,292,NaN,NaN,16262.500000
1,38458,539,F,1973-07-11,S,420-721,2006-02-04 11:51:08.233,22.0,1438500.0,2007-10-18 19:57:45.503,...,12000.0,13732.0,17762.0,Y,48.473648,2,20,4,NaN,25018.181818
2,7009,1113,F,1973-04-06,S,NaN,2006-02-04 11:51:08.233,8.0,309300.0,2007-05-30 15:21:10.863,...,0.0,6372.0,1856.0,Y,48.736482,2,161,NaN,NaN,22025.000000
3,1374842,1300,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,110300.0,2007-03-25 12:49:30.170,...,0.0,2206.0,1522.0,Y,NaN,2,227,NaN,NaN,11400.000000
4,1383660,1024,M,NaT,S,NaN,2006-02-05 16:56:58.000,2.0,33500.0,2006-09-09 14:55:21.687,...,0.0,670.0,110.0,Y,NaN,2,424,NaN,NaN,14000.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7529,343892,130,F,1983-04-28,S,NaN,2006-02-04 11:51:08.233,22.0,383300.0,2007-10-28 12:35:20.587,...,0.0,7866.0,2884.0,Y,38.677618,2,10,NaN,11.0,10718.181818
7530,312177,130,F,1981-08-24,S,NaN,2006-02-04 11:51:08.233,18.0,385800.0,2007-11-07 19:22:06.137,...,7000.0,7870.0,4292.0,Y,40.353183,2,0,NaN,11.0,9511.111111
7531,454881,1181,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,85800.0,2007-04-14 21:13:18.977,...,0.0,1716.0,0.0,Y,NaN,2,207,NaN,NaN,28600.000000
7532,973807,812,M,NaT,S,NaN,2006-02-04 11:51:08.233,4.0,208200.0,2007-09-12 12:58:43.683,...,0.0,4164.0,1110.0,Y,NaN,2,56,NaN,NaN,38175.000000
7533,47542,2273,F,1979-12-31,S,142-872,2006-02-04 11:51:08.233,3.0,208200.0,2007-02-26 20:59:18.540,...,0.0,4164.0,3368.0,Y,42.001369,2,254,1,NaN,12933.333333

In [191]:
# 혹여 Member로 가입은 되어있으나 구매이력이 없는 상황의 TOTAL_AMT의 결측치 가공 방법
# 평균 금액 즉 결측치는 0과 동일

mem_data.iloc[:, -1]

0       16262.500000
1       25018.181818
2       22025.000000
3       11400.000000
4       14000.000000
            ...
7529    10718.181818
7530     9511.111111
7531    28600.000000
7532    38175.000000
7533    12933.333333
Name: TOTAL_AMT, Length: 7534, dtype: float64

In [192]:
mem_data.iloc[:, -1] = mem_data.iloc[:, -1].fillna(0)

In [197]:
mem_data.iloc[:, -1].value_counts()

5500.000000     137
4400.000000     136
3300.000000     105
7700.000000      76
8800.000000      74
               ...
12754.545455      1
15463.636364      1
4953.571429       1
21605.263158      1
18285.000000      1
Name: TOTAL_AMT, Length: 3242, dtype: int64